---
kind: property
id: P:Autodesk.Revit.DB.FabricationService.PaletteCount
source: html/a421bef8-a36f-d4ef-183b-c0e4f0f30b1c.htm
---
# Autodesk.Revit.DB.FabricationService.PaletteCount Property

The number of palettes in the service.

## Syntax (C#)
```csharp
public int PaletteCount { get; }
```